In [12]:
import pandas as pd
grades = pd.read_csv("School_Grades.csv")

grades.head()

    ID FirstName LastName  Subject  Marks Grade
0  HC1    Ritika    Singh     Arts     92     A
1  HC2    Ritika    Singh     Math     96    A+
2  HC3    Ritika    Singh  Science     96    A+
3  HC4    Ritika    Singh  English     94     A
4  HC5      Yash  Agarwal     Arts    100    A+

In [13]:
# Looking for students who score poorly in Math
grades.loc[(grades.Grade =='D') & (grades.Subject == 'Math'),['ID','FirstName','LastName','Grade']]

      ID FirstName LastName Grade
17  HC18  Abhishek    Gupta     D